app/controllers/posts_controller.rb

INSERT INTO `posts` (`updated_at`, `body`, `subject`, `published_at`, `created_at`) VALUES('2009-04-26 05:21:14', 'This is a new post message.', 'Hello World', '2009-04-26 05:21:00', '2009-04-26 05:21:14')
---
  def create
    @post = Post.new(params[:post])
    respond_to do |wants|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
UPDATE `posts` SET `body` = 'This is a edit post message.', `published_at` = '2009-04-26 05:21:00', `subject` = 'Hello World', `updated_at` = '2009-04-26 05:21:14' WHERE `id` = 4
---
  def update
    @post = Post.find(params[:id])
    respond_to do |wants|
      if @post.update_attributes(params[:post])